In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Users/anaconda3/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /Users/anaconda3/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/anaconda3/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/anaconda3/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Users/anaconda3/lib/python3.12/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /Users/anaconda3/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
import pandas as pd
import numpy as np

In [5]:
lst = [1,2,3,4,5]

pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
arr=np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
pd.Series(index = ['Eshant', 'Pranjal', 'Jayesh', 'Ashish'], data = [1,2,3,4])

Eshant     1
Pranjal    2
Jayesh     3
Ashish     4
dtype: int64

In [17]:
steps = {'day1' : 4000, 'day2' : 3000, 'day3' : 12000}

pd.Series(steps)

day1     4000
day2     3000
day3    12000
dtype: int64

In [18]:

pd.Series(5).repeat(3)

0    5
0    5
0    5
dtype: int64

In [20]:
pd.Series(5).repeat(3).reset_index(drop = True)

0    5
1    5
2    5
dtype: int64

In [23]:
s = pd.Series([10,20]).repeat([5,2]).reset_index(drop = True)

s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [24]:
s[4]

10

In [25]:
s[2]

10

In [26]:
s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [27]:
s[2:4]

2    10
3    10
dtype: int64

In [28]:
s[2:-2]

2    10
3    10
4    10
dtype: int64

In [29]:
s[2:5]

2    10
3    10
4    10
dtype: int64

In [30]:
s[1:-1]

1    10
2    10
3    10
4    10
5    20
dtype: int64

In [31]:
sr = pd.Series([1,2,3,4,5,6,7])

sr.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

In [32]:
sr = pd.Series([1,-2,3,-4,5,-6,7])

sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [33]:
sr1 = pd.Series([1,-2,3])
sr2 = pd.Series([1,2,3])
sr1,sr2

(0    1
 1   -2
 2    3
 dtype: int64,
 0    1
 1    2
 2    3
 dtype: int64)

In [34]:
sr1.append(sr1)

0    1
1   -2
2    3
0    1
1   -2
2    3
dtype: int64

In [35]:
sr1 = pd.Series([1,-2,3])
sr2 = pd.Series([1,2,3])
sr3 = sr2.append(sr1)

sr3

0    1
1    2
2    3
0    1
1   -2
2    3
dtype: int64

In [36]:
sr3.reset_index(drop = True)

0    1
1    2
2    3
3    1
4   -2
5    3
dtype: int64

In [37]:
sr1

0    1
1   -2
2    3
dtype: int64

In [38]:

type(sr1[0])

numpy.int64

In [39]:
sr1.astype('float')

0    1.0
1   -2.0
2    3.0
dtype: float64

In [40]:
sr1 = pd.Series([1,2,30,4,5,6,7,8,9,20])
sr1

0     1
1     2
2    30
3     4
4     5
5     6
6     7
7     8
8     9
9    20
dtype: int64

In [41]:
sr1.between(10,50)

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [42]:
ser = pd.Series(["Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])

In [43]:
ser

0          Eshant Das
1        Data Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [44]:
print(ser.str.upper())
print('-'*30)
print(ser.str.lower())

0          ESHANT DAS
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object
------------------------------
0          eshant das
1        data science
2     geeks for geeks
3         hello world
4    machine learning
dtype: object

In [45]:
ser.str.upper()

0          ESHANT DAS
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object

In [47]:
ser

0          Eshant Das
1        Data Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [51]:
for i in ser:
    print(len(i))

10
12
15
11
16

In [52]:
ser = pd.Series(["  Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning  '])

for i in ser:
    print(i , len(i))

  Eshant Das 12
Data Science 12
Geeks for Geeks 15
Hello World 11
Machine Learning   18

In [53]:
ser = ser.str.strip()

for i in ser:
    print(i , len(i))

Eshant Das 10
Data Science 12
Geeks for Geeks 15
Hello World 11
Machine Learning 16

In [54]:

ser.str.split()

0          [Eshant, Das]
1        [Data, Science]
2    [Geeks, for, Geeks]
3         [Hello, World]
4    [Machine, Learning]
dtype: object

In [55]:
ser.str.split()[0]

['Eshant', 'Das']

In [56]:
ser.str.split()[1]

['Data', 'Science']

In [57]:
ser = pd.Series(["Eshant Das","Data@Science","Geeks for Geeks",'Hello@World','Machine Learning'])

ser.str.contains('@')

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [58]:
ser.str.replace('@',' ')

0          Eshant Das
1        Data Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [59]:
ser.str.count('a')

0    2
1    2
2    0
3    0
4    2
dtype: int64

In [60]:
ser.str.startswith('D')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [61]:

ser.str.endswith('s')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [62]:
ser.str.find('Geeks')

0   -1
1   -1
2    0
3   -1
4   -1
dtype: int64

In [63]:
ser.to_list()

['Eshant Das',
 'Data@Science',
 'Geeks for Geeks',
 'Hello@World',
 'Machine Learning']

# Creating Data Frame

In [64]:
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

pd.DataFrame(lst)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [65]:
lst = [['tom',10],['jerry',12],['spike',14]]

pd.DataFrame(lst)

       0   1
0    tom  10
1  jerry  12
2  spike  14

In [66]:
data = {'name':['Tom', 'nick', 'krish', 'jack'], 'age':[20, 21, 19, 18]}


pd.DataFrame(data)

    name  age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [7]:
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data)

df[['Name', 'Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [8]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [71]:
df.loc[1:2, 'two' : 'three']

   two  three
1   20    200
2   30    300

In [73]:
df.iloc[1 : -1, 1:-1 ]

   two  three
1   20    200
2   30    300

In [74]:
df.iloc[:,2:3]

   three
0    100
1    200
2    300
3    400

In [75]:

df.iloc[[0,2],[1,3]]

   two  four
0   10  1000
2   30  3000

# c) Slicing Using Conditions

In [76]:
df.loc[df['two'] > 20, ['three','four']]

   three  four
2    300  3000
3    400  4000

In [77]:

df.loc[df['three'] < 300, ['one','four']]

   one  four
0    1  1000
1    2  2000

In [78]:

df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [79]:
l = [22,33,44,55]
df['five'] = l
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

In [80]:

sr = pd.Series([111,222,333,444])
df['six'] = sr
df

   one  two  three  four  five  six
0    1   10    100  1000    22  111
1    2   20    200  2000    33  222
2    3   30    300  3000    44  333
3    4   40    400  4000    55  444

In [81]:
df['seven'] = df['one'] + 10
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  111     11
1    2   20    200  2000    33  222     12
2    3   30    300  3000    44  333     13
3    4   40    400  4000    55  444     14

In [82]:
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  111     11
1    2   20    200  2000    33  222     12
2    3   30    300  3000    44  333     13
3    4   40    400  4000    55  444     14

In [83]:
del df['six']

df

   one  two  three  four  five  seven
0    1   10    100  1000    22     11
1    2   20    200  2000    33     12
2    3   30    300  3000    44     13
3    4   40    400  4000    55     14

In [84]:
df.pop('five')

df

   one  two  three  four  seven
0    1   10    100  1000     11
1    2   20    200  2000     12
2    3   30    300  3000     13
3    4   40    400  4000     14